examples/cavity_with_baffle/openfoam/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh
runApplication topoSet
runApplication createBaffles -overwrite
runApplication $(getApplication)

foamToVTK -latestTime