examples/cavity_with_baffle/openfoam/system/createBafflesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}

internalFacesOnly true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    internalWall;

        patches
        {
            master
            {
                name            internalWall;
                type            wall;

                patchFields
                {
                    p
                    {
                        type            zeroGradient;
                    }

                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }
                }
            }

            slave
            {
                name            internalWall-shadow;
                type            wall;

                patchFields
                {
                    p
                    {
                        type            zeroGradient;
                    }

                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }
                }
            }
        }
    }
}